{"keras_version": "2.1.5", "backend": "tensorflow", "config": [{"config": {"name": "conv2d_1", "kernel_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 32, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 1, 48, 48], "padding": "same", "bias_constraint": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 32, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 32, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_4", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 64, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_5", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 64, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_6", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 64, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_7", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 128, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_8", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 128, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_9", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 128, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 64, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 64, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 6, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_3"}, "class_name": "Dense"}], "class_name": "Sequential"}